"""
Задача №48.
Планеты вращаются вокруг звезд по эллиптическим орбитам.
Назовем самой далекой планетой ту, орбита которой имеет
самую большую площадь. Напишите функцию
find_farthest_ordit(list_of_orbits)
"""

# orbits = [(6, 6), (2.5, 10), (5, 9), (7, 3)]
# print(max(orbits, key = lambda x: x[0] * x[1] * (x[0] != x[1])))


"""
Задача №50.
Определить являтся ли число двухзначным. Вводится список чисел,
вывести только двухзначные числа.
"""

# n = '8 11 0 -23 140'

# n = n.split()

# list_1 = list(filter(lambda x: len(str(abs(int(x)))) == 2, n))
# print(list_1)



